zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
/*-------------------------------------------------------------------------*/
/* PIC10F_PRG.cpp                                                          */
/*                                                                         */
/*  Purpose: Serial PIC Programming algorithms for PIC10F20x (in WinPic).  */
/*  Author : Wolfgang Buescher (DL4YHF)                                    */
/*     Use of this sourcecode for commercial purposes strictly forbidden ! */
/*                                                                         */
/*  Date   : 2005-05-18  (ISO 8601 format, YYYY-MM-DD)                     */
/*  State  : UNDER DEVELOPMENT - NOT WORKING PROPERLY YET !                */
/*                                                                         */
/*  2009-06-04:  Ported to wxWidget by Philippe Chevrier                   */
/*                                                                         */
/*  Literature:                                                            */
/*   [PIC10Fps] = "PIC10F200/202/204/206 Memory Programming Specification" */
/*                Microchip DS41228D (or later ? )                         */
/*-------------------------------------------------------------------------*/

#define L_RELEASE_VERSION 0

// Revsion history - NEWEST entry first !
//
// 2005-05-01:  Tried to add support for a PIC10F20x after receiving(!)
//     a couple of samples from Johan Bodin (SM6LKM), not from Microchip(!) .
//     Because the PIC10F20x programming algorithms are TOTALLY different
//     from everything else (what would you expect..), the "new"
//     algorithms are located in PIC10F_PRG.cpp .
//

#include <wx/intl.h>
#include "PIC_HW.h"     // Routines to drive the programmer hardware interface
#include "Devices.h"    // need T_PicDeviceInfo here !
#include "Config.h"     // permanently saved Config-structure
#include <Appl.h>       // APPL_ShowMsg(), etc
#include "PIC_HEX.h"    // access routines to the "hex data buffer"
#include "PIC_PRG.h"    // generic defines for programming routines
#include "PIC10F_PRG.h" // header for the PIC10F20x programming algorithms


//----------------------------------------------------------------------------
//  Variables
//----------------------------------------------------------------------------

int  PIC10F_iCurrTargetAddress;   // current target address ("PC" inside the PIC)
// INCREMENTED IN PIC10F_IncrAddress() ONLY !
static int  PIC10F_iMaskAddress;  // added by L.Lisovskiy 2006-03-28 to support PIC12F508
int  PIC10F_iNrOfErrors;
uint16_t PIC10F_wTempConfigWord;      // config word, read before erase
uint16_t PIC10F_wReadOscCalibWord;    // oscillator calibration word, read before erase
uint16_t PIC10F_wReadOscCalibBackup;  // backup oscillator calibration word, read before erase


//----------------------------------------------------------------------------
//  Low-level stuff to communicate with the PIC10F20x via ICSP .
//----------------------------------------------------------------------------


//----------------------------------------------------------------------------
bool PIC10F_EnterProgMode( void )
// Enter programming mode for PIC10F .
// > The Program/Verify mode is entered by holding ICSPCLK and ICSPDAT low
// > while raising Vdd pin from VIL to VDD (YHF: 0 to 5 V) .
// > Then raise Vpp from VIL ("zero") to VIHH (12 V).
//
// This is almost the same as entering "programming mode"
// for the PIC16Fxxx-family, with Config.iNeedPowerBeforeRaisingMCLR = true (!).
{
//  int i;

//  PHWInfo.iCurrProgAddress = 0x0000; // added 2008-05-18 for the plugin-DLLs

    // ex: PIC_HW_ProgMode();  // raise Vpp to 12 V while CLOCK+DATA = low .

    // Added 2004-05-30, due to problems with JDM programmer with 16F877A
    //                   when programming+verify in two separate overs .......
    if( PIC_HW_interface.type==PIC_INTF_TYPE_JDM2 )
    {
        // In the "JDM", things may be different, because it is impossible here
        // to turn the PIC's supply voltage quickly on.
        // Here, for the PIC10F (in contrast to many others), the programming spec
        //  clearly shows "Vdd turned on before Vpp" . How to achieve this with the JDM interface :

        // Make sure C2 (100uF) is charged to 8 volts  and  C3 (22uF)
        // charged to 5 volts (=negative bias voltage between PIC's Vss and PC's GROUND).
        PIC_HW_SetClockAndData(false,false);  // -> RTS=-12V, DTR=-12V
        PIC_HW_SetVpp( true );                // -> TXD=+12V , charges C2 (100uF) to ~13.2 volts
        // this is quite fast, because no resistors are involved:  13V*100uF/5mA = 260ms
        PIC_HW_LongDelay_ms(500/*ms*/); // give the CPU to another thread to make windoze happy while charging C2
        // Now pull Vpp / Vpp low, so the PIC enters the RESET state .
        PIC_HW_SetVpp( false );               // -> TXD= -12V (hard limited to -5.7V), charges C3 to 5 volts
        //        while C2 remains at 8 volts.
        PIC_HW_Delay_us(10000); // 10ms between exiting and re-entering prog mode with Vdd AND Vpp at GND
        PIC_HW_SetVpp(true);  // Now there should be a faster rise on Vpp = "Vpp",
        // from 0 V to almost 13 V (from the PIC's point of view).
        // For many PIC devices, this rise time must not exceed 1 MICROSECOND,
        // which is the reason why some ultra-simple (and ugly) programmers fail .
        // Measured on an oscilloscope, where GROUND is connected to the PC's ground!!
        // (even if you don't want it that way), Vpp rises from -5 to +8 volts.
        // After Vpp rised from 0 to 12 volts..
        PIC_HW_Delay_us(2);   // wait "P7" = 2 us in STDP mode, before the 1st clock pulse

    } // end if < JDM programmer >
    else
    {
        //----------------------- ALL OTHER PROGRAMMERS (except "JDM") --------------------------
        // PIC10Fxxx definitely requires "Vdd turned on before Vpp" . So :
        PIC_HW_SetClockAndData(false,false);
        PIC_HW_SetClockEnable(true );  // Enable the tristate buffer outputs (PC->PIC)
        PIC_HW_SetDataEnable( true );  // (up to now, only required for AN589 programmer)
        PIC_HW_SetClockAndData(false,false);  // both CLOCK and DATA LOW to enter prog mode

        // don't ask why this WAS done THREE times (one time must work) ..
        // for(i=0; i<3; ++i)
        {

            PIC_HW_SetVpp(false);          // ensure Vpp is off
            PIC_HW_SetVdd(false);          // ensure Vdd is off
            PIC_HW_PullMclrToGnd(true);    // tie Vpp to ground (not many adapters support this)
            PIC_HW_LongDelay_ms(500);      // wait a LOOONG time to discharge various caps...
            // Because some "ugly style" programmers switch Vdd together with Vpp,
            // turn Vpp off for a very short time to generate a steep
            // rise on Vpp while Vdd is still present :
            if( PIC_HW_interface.wSeparateVddAndVppControl )  // 0=no, 1=yes
            {
#if(1)      // time between Vdd and Vpp seemed a bit too long, due to the terribly slow I/O-port driver
                PIC_HW_SetVdd(true);    // turn PIC's supply voltage on
                // wait a short time before raising Vpp (*AFTER Vdd*)
                if( Config.iSlowInterface )  // this option for "bad, slow interfaces" was added 2005-06
                    PIC_HW_Delay_us(20);
                else PIC_HW_Delay_us(5);
                // The PIC10F20x prog spec says "Tppdp MIN 5us" but not too clear what it is !
                // (Fig 3-1 shows Tppdp between Vdd rise and Vpp rise, but Table 6-1 says
                //   >  Tppdp = "Hold time *AFTER* Vpp up " (did they mean "Vdd up" ? - bs...@#! )
                // What happens if Vdd is applied, and Vpp rises much later, and MCLR is disabled ?
                // PIC will start running happily with its fast-starting 4-MHz-RC-oscillator !
                // In fact, entering programming mode with a PIC10F206 sample was VERY unreliable .
                PIC_HW_PullMclrToGnd(false);    // stop pulling MCLR to ground (added 2008-05-29)
                PIC_HW_SetVpp(true);    // raise Vpp from 0 V to 13 V within a VERY short time
#else       // Time between Vdd and Vpp seemed a bit too long, due to the terribly slow I/O-port driver,
                // so tried this in 2005-05-18, more reliable programming mode entry ?
                // Test result: DIDN'T WORK AT ALL ! PIC10F20x really seems to NEED Vdd BEFORE Vpp !
                PIC_HW_SetVddAndVpp(true,true);    // turn PIC's supply voltage AND programming voltage on (simultaneously)
#endif
                // [PIC10Fps] requires MCLR rise time for Program/Verify mode entry
                //            must be MAXIMUM 1.0 use (yes, ONE MICROSECOND) .
                //  Caution,  not all programming interfaces can handle this !
            }
            else  // Need power before raising Vpp ,  but no separate Vdd and Vpp control lines :
            {
                // (like in the COM84 adapter, which has a Vpp(!) but no Vdd(!) control line)
                PIC_HW_LongDelay_ms(200);  // wait until Vpp is really 0 volt
                PIC_HW_SetVdd(true);    // turn PIC's supply voltage on (no effect for COM84)
                if( Config.iSlowInterface )
                    PIC_HW_Delay_us(20);
                else PIC_HW_Delay_us(5); // see WoBu's rant about lousy programming specs above !
                PIC_HW_PullMclrToGnd(false); // stop pulling MCLR to ground (added 2008-05-29)
                PIC_HW_SetVpp(true);     // an utterly slow rise on Vpp (because of discharged cap)
                if( PicHw_fTogglingTxD ) // If there is a charge pump for "Vpp", keep toggling a bit longer...
                {
                    PIC_HW_LongDelay_ms(500/*ms*/);  // while WAITING here, feed the UART's transmit buffer (!)
                }
                else // if there is NO charge pump for "Vpp", use the typical "Vpp-ON-delay",
                {
                    // then turn Vpp off for a short time, and turn it on to produce a FAST RISE on Vpp:
                    PIC_HW_LongDelay_ms(200); // time required by INTERFACE (something like 200ms)
                    PIC_HW_SetVpp(false);   // Vdd(!) capacitor should be charged now,
                    //   the next positive slope on Vpp will be steeper
                    PIC_HW_Delay_us(10000); // 10ms between exiting and re-entering prog mode with Vdd AND Vpp at GND
                    PIC_HW_PullMclrToGnd(false); // stop pulling MCLR to ground (added 2008-05-29)
                    PIC_HW_SetVpp(true);    // now this should be a faster rise on Vpp
                }
            } // end < no separate Vdd and Vpp control lines >
        } // end for < try 2 enter prog mode  ONE or THREE times ? >
    } // end if < not "JDM" programmer >

    // caller must not forget to turn Vpp & Vdd off after he's ready !

    // Program/Verify mode entry will set the address pointer
    //          to 0x1FF for the PIC10F200/204
    //          or 0x3FF for the PIC10F202/206
    //          or 0x7FF for the PIC12F509      !
    //  .. which means, the PC points to the CONFIGURATION WORD now .
    // Modified by L.Lisovskiy 2006-03-28 to support PIC12F508
    // EX:  if( PIC_DeviceInfo.lCodeMemSize > 256 )
    //        PIC10F_iCurrTargetAddress = 0x03FF;  // for PIC10F202 / 206
    //  else  PIC10F_iCurrTargetAddress = 0x01FF;  // for PIC10F200 / 204
    PIC10F_iMaskAddress = ((PIC_DeviceInfo.lCodeMemSize&0xFF80)<<1) - 1;
    PIC10F_iCurrTargetAddress = PIC10F_iMaskAddress;

