zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
//  PHWInfo.iCurrProgAddress = PIC10F_iCurrTargetAddress; // added 2008-05-18 for the plugin-DLLs

    return true;
} // end PIC10F_EnterProgMode()

//----------------------------------------------------------------------------
void PIC10F_LeaveProgMode( void )
{
    PIC_HW_ProgModeOff();  // programming voltage off, clock off, data high-z
}


//----------------------------------------------------------------------------
void PIC10F_SendCmd6(uint8_t bCmd6,  bool fFlush)
// Sends a 6-bit command to the PIC in ICSP mode .
{
    int i, data_bit;
    if(PIC_PRG_iSimulateOnly)
        return;
    // Based on [PIC10Fps], Chapter 3.1.2 "Serial Program/Verify Operation" .
    PIC_HW_SetClockAndData(false,false );  // start condition
    PIC_HW_SetClockEnable( true );         // some interfaces may need this..
    PIC_HW_SetDataEnable( true );   // "Enable" signals only for AN589 programmer
    if( Config.iSlowInterface )
        PIC_HW_Delay_us(100);
    else PIC_HW_Delay_us(1);        // wait at least TDLY2 from last edge of previous cmd

    for ( i=0; i<6; ++i )           // send 6-bit command, LSB first..
    {
        data_bit = (bCmd6&(1<<i)) != 0;     // get next command bit (0 or 1)
        PIC_HW_SetClockAndData(true, data_bit);
        if( Config.iSlowInterface )
            PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
        else PIC_HW_Delay_us(1);     // normal mode for "good" interfaces
        PIC_HW_SetClockAndData(false,data_bit); // bit latched on falling edge !  so data must remain valid !
        if( Config.iSlowInterface )
            PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
        else PIC_HW_Delay_us(1);     // normal mode for "good" interfaces
    }
    // Added 2008-05-19: Let "smart" interfaces flush the clock- and data-transitions.
    //  This may be required for some programmers with USB interface which use burst-transfers.
//  PicHw_FlushCommand( bCmd6,6,    0,0/*no data*/  );

    PIC_HW_Delay_us(1);             // delay required between command/command or command/data
} // end PIC10F_SendCmd6()


//----------------------------------------------------------------------------
void PIC10F_SendData14(uint16_t wData14)
// Sends a 14-bit data word ,
//  of which only 12 bit are used, because the PIC10F has a 12-bit core .
{
    int i, data_bit;
    if(PIC_PRG_iSimulateOnly)
        return;
    // Based on [PIC10Fps], Chapter 3.1.2 "Serial Program/Verify Operation" .
    PIC_HW_SetClockAndData(false,false );  // start condition
    PIC_HW_SetClockEnable( true );         // some interfaces may need this..
    PIC_HW_SetDataEnable( true );          // "Enable" signals only for AN589 programmer
    PIC_HW_SetClockAndData(true, false);   // Send START bit ..
    if( Config.iSlowInterface )
        PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
    else PIC_HW_Delay_us(1);     // specified delay for "good" interfaces
    PIC_HW_SetClockAndData(false,false);   // > input data is "don't care" for start bit
    if( Config.iSlowInterface )
        PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
    else PIC_HW_Delay_us(1);     // specified delay for "good" interfaces
    // Now send 14 data bits, LSB first, the two last bits are ignored for this 12-bit core :
    for ( i=0; i<14; ++i )          // send 6-bit command, LSB first..
    {
        data_bit = (wData14&(1<<i)) != 0;     // get next data bit (0 or 1)
        PIC_HW_SetClockAndData(true, data_bit); // send data bit
        if( Config.iSlowInterface )
            PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
        else PIC_HW_Delay_us(1);     // specified delay for "good" interfaces
        PIC_HW_SetClockAndData(false,data_bit); // bit latched on falling edge !  so data must remain valid !
        if( Config.iSlowInterface )
            PIC_HW_Delay_us(50);    // extra long delay for "bad" interfaces
        else PIC_HW_Delay_us(1);     // specified delay for "good" interfaces
    }
    PIC_HW_SetClockAndData(true, false);   // Send STOP bit ..
    if( Config.iSlowInterface )
        PIC_HW_Delay_us(50);       // extra long delay for "bad" interfaces
    else PIC_HW_Delay_us(1);        // specified delay for "good" interfaces
    PIC_HW_SetClockAndData(false,false);   // > input data is "don't care" for stop bit
    if( Config.iSlowInterface )
        PIC_HW_Delay_us(50);
    else PIC_HW_Delay_us(1);
} // end PIC10F_SendData14()

//----------------------------------------------------------------------------
uint16_t PIC10F_ReadDataFromMemory(void)
// Reads a 14-bit data word from the current memory location INSIDE THE PIC .
//  Only 12 bits are meaningful, because the PIC10F has a 12-bit core .
// The internal address counter is not affected by this command !
{
    if( PIC_PRG_iSimulateOnly )
    {
        // SIMULATE ONLY -> return some dummy to play with
        return PIC10F_iCurrTargetAddress & 0x0FFF;
    }
    else
    {
        PIC10F_SendCmd6( 0x04, true );   // send 6-bit command "Read Data From Program Memory", and flush the queue
        return PIC_HW_SerialRead_14Bit() & 0x0FFF; // routine for 14-bit core should work for this too (?)
    }
} // end PIC10F_ReadDataFromMemory()

//----------------------------------------------------------------------------
void PIC10F_IncrAddress(int iNrOfSteps)
// increments the PIC's internal address pointer,
// but also PIC10F_iCurrTargetAddress (our "local copy") .
{

    if(iNrOfSteps<0)  // added by L.Lisovskiy 2006-03-28
    {
        APPL_ShowMsg( 0, _("PIC10F Prog: INVALID address increment=%ld !"),  iNrOfSteps);
        return;
    }

    while(iNrOfSteps--)
    {
        if( ! PIC_PRG_iSimulateOnly )
            PIC10F_SendCmd6( 0x06, true );  // send 6-bit command "Increment Address"
        ++PIC10F_iCurrTargetAddress;  // keep track of the PIC's internal instruction pointer ("PC")..
//     PHWInfo.iCurrProgAddress = PIC10F_iCurrTargetAddress; // added 2008-05-18 for the plugin-DLLs
        // Example for PIC10F200/204 :
        // Lousy spec, about the "program memory map" in chapter 2.1 ...
        // > " The PC will increment from 0x000-0x0FF, then to 0x100 , not to 0x000 "
        // Does this apply to PROGRAMMING MODE ?!  Obviously not, because IF,
        //    there would be no chance to set the PC to zero !
        // EX: if( PIC_DeviceInfo.lCodeMemSize<=256 )
        //      { PIC10F_iCurrTargetAddress &= 0x1FF;
        //      }
        //     else
        //      { // here, the PC should wrap from 0x3FF to 0x000
        //        // (not to 0x200 as the lousy spec seemed to say) ...
        //        PIC10F_iCurrTargetAddress &= 0x3FF;
        //      }
        // more "universal" address wrap by L.L., works for 12F509 too:
        PIC10F_iCurrTargetAddress &= PIC10F_iMaskAddress;
//     PHWInfo.iCurrProgAddress = PIC10F_iCurrTargetAddress; // added 2008-05-18 for the plugin-DLLs

