zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
    }
}

//----------------------------------------------------------------------------
void PIC10F_CompareToVerify( uint16_t wReadValue, uint16_t *pwMemFlags )
{
    uint32_t dwTemp;

    if( PicBuf_GetBufferWord( PIC10F_iCurrTargetAddress, &dwTemp ) )
    {
        if( (uint32_t)(wReadValue&0x0FFF) != (uint32_t)(dwTemp&0x0FFF) )
        {
            if ( PIC10F_iCurrTargetAddress!=PIC_DeviceInfo.lAddressOscCal
                    || Config.iDontCareForOsccal ) // ok to complain about THIS location ?
            {
                ++PIC10F_iNrOfErrors;
                *pwMemFlags |= PIC_BUFFER_FLAG_VFY_ERROR;
                if( PIC10F_iNrOfErrors < 20 )
                {
                    APPL_ShowMsg( 0, _( "Verify Error: %06lX: read %06lX, wanted %06lX" ),
                                  (long)PIC10F_iCurrTargetAddress, (long)wReadValue, (long)dwTemp );
                }
            }
            else // oscal value different from buffer contents ..
            {
                APPL_ShowMsg( 0, _("Info: different OSCCAL values: read=%06lX, buffer=%06lX"),
                              (long)wReadValue, (long)dwTemp );
            }
        }
        else // verify ok (for current location)
        {
            *pwMemFlags &= ~PIC_BUFFER_FLAG_VFY_ERROR;
        }
    }
} // end PIC10F_CompareToVerify()

//----------------------------------------------------------------------------
bool PIC10F_ReadAll(
    int iPicPrgAction ) // PIC_ACTION_READ, PIC_ACTION_BLANK_CHECK, or PIC_ACTION_VERIFY .
// Return value:
//  true = "device not blank" for PIC_ACTION_BLANK_CHECK + PIC_ACTION_READ
//  true = "verify ok"        for PIC_ACTION_VERIFY
//  false= an error occurred
{
// uint32_t dwWordIndex;
// uint32_t dwTemp;
    uint16_t  w;
    uint16_t  wMemFlags;
    int   i,iLastUsedAddress=-1;
    bool  not_blank = false;
    bool  fReadProtected;

    if( PIC_DeviceInfo.lCodeMemSize <= 0 )
        return false;        // avoid div by zero (in progress indicator)

    PIC10F_iNrOfErrors = 0;
    if( ! PicHw_iConnectedToTarget )
    {
        PIC_HW_ConnectToTarget();  // connect ICSP to target (if necessary)
    }
    // Do NOT change the supply voltage setting here (we may be VERIFYING)
    PIC10F_EnterProgMode();   // enter STDP programming mode (and set PIC10F_iCurrTargetAddress)

    PIC10F_wTempConfigWord = PIC10F_ReadDataFromMemory();   // read CONFIG word from 0x1FF or 0x3FF
    if( iPicPrgAction==PIC_ACTION_READ )
    {
        // ex: PicBuf_SetBufferWord( PIC10F_iCurrTargetAddress, PIC10F_wTempConfigWord );
        // Due to Microchip's ugly "logic address" game with the CONFIG WORD located
        // at 0x0FFF (instead of 0x03FF or 0x01FF) :
        PicBuf_SetBufferWord( 0x0FFF/*"logic address"-baaah*/ , PIC10F_wTempConfigWord );
    }
    if( iPicPrgAction==PIC_ACTION_VERIFY )
    {
        PIC10F_CompareToVerify( PIC10F_wTempConfigWord, &wMemFlags );
    }
    PIC10F_IncrAddress(1); // increments PIC10F_iCurrTargetAddress, and wraps from end of address space to zero
    fReadProtected = (PIC10F_wTempConfigWord & 0x008) == 0;  // is the PIC read-protected or not ?

    // Arrived here: PIC10F_iCurrTargetAddress should be ZERO (!) .
    //  Read CODE memory (including the OSCCAL word) :
    for(i=0; i<PIC_DeviceInfo.lCodeMemSize; ++i)
    {
        wMemFlags = PicBuf_GetMemoryFlags( PIC10F_iCurrTargetAddress );
        w = PIC10F_ReadDataFromMemory();
        if( (w&0x0FFF) != 0x0FFF )
        {
            not_blank = true;
            iLastUsedAddress = i;
        }
        if( iPicPrgAction==PIC_ACTION_READ )
        {
            PicBuf_SetBufferWord( PIC10F_iCurrTargetAddress, w );
        }
        if( iPicPrgAction==PIC_ACTION_VERIFY )
        {
            PIC10F_CompareToVerify(w, &wMemFlags );
        }
        if( PIC10F_iCurrTargetAddress == PIC_DeviceInfo.lAddressOscCal )
        {
            PIC10F_wReadOscCalibWord = w;
        }
        PicBuf_SetMemoryFlags( PIC10F_iCurrTargetAddress, wMemFlags );
        PIC10F_IncrAddress( 1 );   // increment PC for next code memory location
        APPL_ShowProgress( (100*i) / PIC_DeviceInfo.lCodeMemSize );
    } // end for < all PROGRAM MEMORY locations, including the osccal word >

    if( iPicPrgAction!=PIC_ACTION_VERIFY )
    {
        for(i=0; i<PIC_DeviceInfo.lCodeMemSize; ++i)
        {
            PicBuf_SetMemoryFlags( i,
                                   ( i<= iLastUsedAddress ) ? PIC_BUFFER_FLAG_USED : PIC_BUFFER_FLAG_UNUSED );
        }
    }

    // Arrived here, CODE MEMORY has been read, and the PC points to the first USER ID location
    //  (0x100 for PIC10F200/4, 0x200 for PIC10F202/6, 0x400 for PIC12F509),
    //  directly followed by the Backup OSCCAL value (@ 0x104 or 0x204 or 0x404)
    for(i=0; i<=4; ++i)   // read four User ID locations and the BACKUP OSCCAL value..
    {
        w = PIC10F_ReadDataFromMemory();
        if( iPicPrgAction==PIC_ACTION_READ )
        {
            PicBuf_SetBufferWord( PIC10F_iCurrTargetAddress, w );
        }
        if( i==4 )
        {
            PIC10F_wReadOscCalibBackup = w;
        }

        PIC10F_IncrAddress( 1 );   // increment PC for next code memory location
    } // end for < all PROGRAM MEMORY locations, including the osccal word >

    PIC10F_LeaveProgMode(); // leave STDP programming mode

    // Check the OSCCAL values. The PIC10F20x only has this poor 4-MHz-RC-oscillator,
    // proper calibration is important for many applications !
    if( (!fReadProtected) && ((PIC10F_wReadOscCalibWord&0x0F00) != 0x0C00) )
    {
        APPL_ShowMsg( 0, _("PIC10F Prog Warning: OSCCAL value (%03lX) looks invalid !"),
                      (long)PIC10F_wReadOscCalibWord );
    }
    if( (!fReadProtected) && (PIC10F_wReadOscCalibWord != PIC10F_wReadOscCalibBackup ) )
    {
        APPL_ShowMsg( 0, _("PIC10F Prog Warning: OSCCAL value (%03lX) not equal to OSCCAL BACKUP (%03lX) !"),
                      (long)PIC10F_wReadOscCalibWord, (long)PIC10F_wReadOscCalibBackup );
    }
    else if( (PIC10F_wReadOscCalibBackup & 0x0F00) != 0x0C00 )
    {
        APPL_ShowMsg( 0, _("PIC10F Prog Warning: OSCCAL BACKUP value (%03lX) looks invalid !"),
                      (long)PIC10F_wReadOscCalibBackup );
    }

    if( iPicPrgAction == PIC_ACTION_VERIFY )
        return PIC10F_iNrOfErrors==0;
    else return not_blank;

} // end PIC10F_ReadAll()


//----------------------------------------------------------------------------
bool PIC10F_ProgAndVerifyOneLocation(
    int iAddress, uint16_t wData, uint16_t wVerifyMask,
    bool fMayShowErrorMessage )
{
    uint16_t wRead;
    uint16_t wMemFlags;
    bool fResult;

//  PHWInfo.iCurrProgAddress = iAddress; // added 2008-05-18 for the plugin-DLLs

    // Based on "program cycle" from [PIC10Fps], Figure 3-10 :
    PIC10F_SendCmd6( 0x02, false ); // "Load Data for Program Memory" ..
    PIC10F_SendData14( wData );     // ..immediately followed by 14 data bits (+START & STOP)
    // Added 2008-05-19: Let "smart" interfaces flush the clock- and data-transitions.
    //  This may be required for some programmers with USB interface which use burst-transfers.
//  PicHw_FlushCommand( 0x02,6,    wData,14 );

