zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
    PIC10F_SendCmd6( 0x08, true ); // "Begin Programming" (externally timed)
    PIC_HW_Delay_us( 2000 );       // "typical" 1ms but "max" 2ms ?!?
    PIC10F_SendCmd6( 0x0E, true ); // "End Programming"
    // ex: PIC_HW_Delay_us( 100  );       // wait for internal programming voltage discharge
    PIC_HW_Delay_us( 500  );       // wait a little longer, because programming failed too often

    wRead = PIC10F_ReadDataFromMemory() & wVerifyMask; // read back to verify
    wMemFlags = PicBuf_GetMemoryFlags( iAddress );
    if( wRead != (wData & wVerifyMask) )
    {
        // report programming failure :
        wMemFlags |= PIC_BUFFER_FLAG_PRG_ERROR;
        if( fMayShowErrorMessage )
            APPL_ShowMsg( 0, _( "Verify Error: %06lX: read %06lX, wanted %06lX" ),
                          (long)iAddress,  (long)wRead,   (long)wData  );

        fResult = false;
    }
    else
    {
        wMemFlags &= ~( PIC_BUFFER_FLAG_PRG_ERROR | PIC_BUFFER_FLAG_VFY_ERROR );
        fResult = true;
    }
    PicBuf_SetMemoryFlags( iAddress, wMemFlags );
    return fResult;
} // end PIC10F_ProgAndVerifyOneLocation()


//----------------------------------------------------------------------------
bool PIC10F_ProgramAll(
    int iPicPrgAction ) // PIC_ACTION_WRITE or PIC_ACTION_ERASE .
// - Includes "bulk" erase ("full"~"chip erase" or "standard"~"without fuses")
// - Only enters programming mode ONCE(!!) because some ugly interfaces
//   have severe problems entering and leaving programming mode rapidly
// - Takes extra care for the OSCCAL bits and OSCCAL BACKUP bits
{
// uint32_t dwWordIndex;
    uint32_t dwTemp;
    uint16_t  w /*, wRead*/;
    int   i;
    bool  fWasProtected;

    if( PIC_DeviceInfo.lCodeMemSize <= 0 )
        return false;                  // avoid div by zero (in progress indicator)

    PIC10F_iNrOfErrors = 0;
    if( ! PicHw_iConnectedToTarget )
    {
        PIC_HW_ConnectToTarget();  // connect ICSP to target (if necessary)
    }

    PIC10F_EnterProgMode();   // enter programming mode (and set PIC10F_iCurrTargetAddress)
    // CAUTION: Program/Verify mode entry will set the address pointer
    //          to 0x1FF for the PIC10F200/204
    //         and 0x3FF for the PIC10F202/206 !
    //  .. which means, the PC points to the CONFIGURATION WORD now .
    PIC10F_wTempConfigWord = PIC10F_ReadDataFromMemory(); // read from 0x1FF or 0x3FF
    PIC10F_IncrAddress(1); // increments PIC10F_iCurrTargetAddress, and wraps from end of address space to zero
    fWasProtected = (PIC10F_wTempConfigWord & 0x008) == 0;  // Code protection bit is LOW-active !

    // Increment the address counter to 0x0FF or 0x1FF, depending on device type .
    // In PIC10F20x devices, the Oscillator Calibration Bits are contained in a
    // MOVLW instruction which is located at the Reset "Vector"(!).
    // The "Reset Vector" is not a vector as we know it; anyway it's at
    //  0x0FF for PIC10F200/204 and at 0x1FF for PIC10F202/206 .
    // Where it is, can be seen in the DEVICE INFO STRUCT (defined in devices.h) .
    PIC10F_IncrAddress( PIC_DeviceInfo.lAddressOscCal & PIC10F_iMaskAddress );

    // Arrived here, PIC10F_iCurrTargetAddress must be 0x0FF or 0x1FF ...
    PIC10F_iCurrTargetAddress = PIC10F_iCurrTargetAddress;  // DEBUG: 255 or 511 !
    PIC10F_wReadOscCalibWord = PIC10F_ReadDataFromMemory(); // read from 0x0FF or 0x1FF

    // Increment the address counter another N times to let it point to 0x104 or 0x204 or 0x404:
    PIC10F_IncrAddress( PIC_DeviceInfo.lIdMemBase+4 - (PIC10F_iMaskAddress>>1) );  // guess what the result is.. FIVE ?
    PIC10F_iCurrTargetAddress = PIC10F_iCurrTargetAddress;  // DEBUG: 260 or 516 !

    // Arrived here, the address counter must be 0x104 (260) or 0x204 (516) .
    PIC10F_wReadOscCalibBackup = PIC10F_ReadDataFromMemory(); // read from 0x0FF or 0x1FF
    // Arrived here, the address counter is still at 0x104 or 0x204 ...

    // Decide which of the *three* OCSCCAL values (two read from chip + one from buffer)
    //        should be written back later .
    // Note: The BACKUP OSCCAL VALUE seems to be a complete MOVLW instruction too !
    //  ( it was 0x0CF4 in a sample received from SM6LKM ) .
    if( (PIC10F_wReadOscCalibBackup & 0x0F00) != 0x0C00)
    {
        // not a MOVLW instruction (binary: 1100 kkkk kkkk ) !
        APPL_ShowMsg( 0, _("PIC10F Prog Warning: Read BACKUP OSCCAL value (%03lX) looks invalid !"),
                      (long)PIC10F_wReadOscCalibBackup );

        if( (PIC10F_wReadOscCalibWord & 0x0F00) != 0x0C00 )
        {
            // both BACKUP AND(!) MAIN OSCCAL word look bad..
            APPL_ShowMsg( 0, _("PIC10F Warning: Both OSCCAL (%03lX) and OSCCAL BACKUP (%03lX) look invalid !"),
                          (long)PIC10F_wReadOscCalibWord, (long)PIC10F_wReadOscCalibBackup );
            // Use the OSCCAL values from the MEMORY BUFFER ,
            //  and make sure it contains a valid MOVLW opcode .
            PicBuf_GetBufferWord( PIC_DeviceInfo.lIdMemBase+4/*addr backup OSCCAL*/, &dwTemp );
            if( (dwTemp & 0x0F00)==0x0C00 )
            {
                // BACKUP VALUE from buffer memory looks good -> use it for both locations
                PIC10F_wReadOscCalibWord = PIC10F_wReadOscCalibBackup = (uint16_t)dwTemp;
            }
            else // BACKUP VALUE from buffer memory is invalid too ->
            {
                PicBuf_GetBufferWord( PIC_DeviceInfo.lAddressOscCal, &dwTemp ); // try "the other one"
                if( (dwTemp & 0x0F00)==0x0C00 )
                {
                    // main OSCCAL VALUE from buffer memory looks good -> use it for both locations
                    PIC10F_wReadOscCalibWord = PIC10F_wReadOscCalibBackup = (uint16_t)dwTemp;
                }
                else
                {
                    if( Config.iDontCareForOsccal )
                    {
                        APPL_ShowMsg( 0, _("PIC10F: Option \"Don't care for OSCCAL\" set, using a 'default' OSCCAL word !!"));
                        PIC10F_wReadOscCalibWord = PIC10F_wReadOscCalibBackup = 0x0C00;
                    }
                    else
                    {
                        APPL_ShowMsg( 0, _("PIC10F: Abort programming (nothing erased). No valid OSCCAL value found !"));
                        APPL_ShowMsg( 0, _("        Enter a valid BACKUP OSCCAL VALUE (like 0x0CF4)"));
                        APPL_ShowMsg( 0, _("        on the Config Register Tab, then try again !"));
                        return false;    // don't try to erase the chip, there is something fishy in here !
                    }
                }
            }
            APPL_ShowMsg( 0, _("PIC10F Warning: Using OSCCAL (%03lX) and OSCCAL BACKUP (%03lX) from buffer !"),
                          (long)PIC10F_wReadOscCalibWord, (long)PIC10F_wReadOscCalibBackup );
        }
        else // BACKUP OSCCAL looks bad, but MAIN OSCCAL value looks good :
        {
            APPL_ShowMsg( 0, _("PIC10F Warning: Replaced bad BACKUP OSCCAL value with main OSCCAL value (%03lX) !"),
                          (long)PIC10F_wReadOscCalibWord );
            PIC10F_wReadOscCalibBackup = PIC10F_wReadOscCalibWord;
        }
    } // end if < backup OSCCAL value looks invalid >
    else // OSCCAL BACKUP VALUE valid :
    {
    }

    if( (!fWasProtected) && (PIC10F_wReadOscCalibWord != PIC10F_wReadOscCalibBackup ) )
    {
        APPL_ShowMsg( 0, _("PIC10F Prog Warning: OSCCAL value (%03lX) not equal to OSCCAL BACKUP (%03lX) !"),
                      (long)PIC10F_wReadOscCalibWord, (long)PIC10F_wReadOscCalibBackup );
    }

