zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
    // If the "main" osccal value looks unhealty, replace it with the backup value :
    if( fWasProtected )
    {
        // if the chip WAS protected, the OSCCAL value (which is part of the code memory)
        // cannot have been read successfully.
        APPL_ShowMsg( 0, _("PIC10F Prog: PIC was protected, using OSCCAL BACKUP value (%03lX) !"),
                      (long)PIC10F_wReadOscCalibBackup );
        PIC10F_wReadOscCalibWord = 0x0C00 | ( PIC10F_wReadOscCalibBackup & 0x00FF);
    }
    else // was NOT protected, OSCCAL value should be valid !
        if( (PIC10F_wReadOscCalibWord & 0x0F00) != 0x0C00 )
        {
            // not a MOVLW instruction (binary: 1100 kkkk kkkk ) !
            APPL_ShowMsg( 0, _("PIC10F Prog Warning: Replaced OSCCAL value (%03lX) with OSCCAL BACKUP (%03lX) !"),
                          (long)PIC10F_wReadOscCalibWord, (long)PIC10F_wReadOscCalibBackup );
            PIC10F_wReadOscCalibWord = 0x0C00 | ( PIC10F_wReadOscCalibBackup & 0x00FF);
        }

    // Though this is a WRITE routine, place the READ value in a buffer (if it's valid)
    //    Why ? Because programming may fail AFTER SUCCESSFULLY ERASING the PIC,
    //          and in that case the user shall simply "try again".
    PicBuf_SetBufferWord( PIC_DeviceInfo.lAddressOscCal, PIC10F_wReadOscCalibWord );
    if( ! Config.iDontCareForOsccal )
    {
        // A VALID OSCCAL VALUE for this chip will be found in the buffer then .
        // A PIC10F20x firmware without the MOVLW instruction at the reset vector
        // will most likely crash !
        PicBuf_SetBufferWord( PIC_DeviceInfo.lIdMemBase+4/*addr backup OSCCAL*/,
                              PIC10F_wReadOscCalibBackup  );
    }


    // Erase the program memory and the config word, AND MAYBE MORE ... "BULK ERASE" !
    // Note on "bulk erase" : There are two flavours of "bulk erase" for the PIC10F20x .
    //     What Microchip call "bulk erase program memory" in the PIC10F20x prog spec is called
    //     "chip erase" for other PICs, if it erases EVERYTHING .
    //  If fEraseAll=true, PIC10F_ProgramAll() performs what they call
    //     "full device bulk erase" here (== "chip erase" in other specs).
    //     It erases EVERYTHING: program memory, config word, User ID locations,
    //     and even the backup oscillator calibration word !
    if( Config.iUseCompleteChipErase )
    {
        // > To perform a FULL DEVICE BULK ERASE (aka "chip erase" ?! ),
        // > increment PC to "0x200/0x400" (NONSENSE, ANOTHER ERROR IN DS41228D)
        // > (first user ID location).
        // But the first user ID location is at 0x100/0x200, stupido !
        // So set the PC from 0x204(0x104) where it is at the moment
        //                 to 0x100(0x200) where it must be.
        // For PIC10F200 (with lCodeMemSize==256), the PC wraps from 0x1FF to 0x000 .
        // For PIC10F206 (with lCodeMemSize==512), the PC wraps from 0x3FF to 0x000 .
        PIC10F_IncrAddress( PIC10F_iMaskAddress - (PIC_DeviceInfo.lIdMemBase+4) + 1 );  // increment PC from OSCCAL backup to MAX, then wrap to zero
        PIC10F_IncrAddress( PIC_DeviceInfo.lIdMemBase );              // increment PC from zero  to 0x100 = 1st USER-ID location
        PIC10F_iCurrTargetAddress = PIC10F_iCurrTargetAddress;
        PIC10F_SendCmd6( 0x09, true );  // send 6-bit command "Bulk Erase [..Program Memory]" and flush the queue
        // Note: There is only one "Bulk Erase" command,
        //   in DS41228D Table 3-1 they call it "Bulk Erase Program Memory" though it's more than this !
        PIC_HW_LongDelay_ms( 50/*milliseconds*/ );   // wait for erase (internally timed)
        // Hopefully the PC is not affected by the erase operation (not specified !).
        // We don't want to exit and re-enter programming mode here, because
        // some crude interfaces out there have serious problems with this .
        // PC should still be at 0x100/0x200, so increment the PC until it wraps to ZERO(!) .
        PIC10F_IncrAddress( PIC10F_iMaskAddress - PIC_DeviceInfo.lIdMemBase + 1 ); // increment PC from 0x200 to 0x3FF, then wrap to zero
    }
    else // no chip erase, but normal erase, without destroying the backup OSCCAL word...
    {
        // For a "normal" erase, the PC must point to the Config Word address (0x1FF or 0x3FF) .
        // At the moment, the PC still points to 0x104/0x204 after reading the Backup OSCCAL value .
        // Due to the different size of the "unimplemented" gap before the config word,
        //  another "if"-statement required here ... grumble
        PIC10F_IncrAddress( PIC10F_iMaskAddress - (PIC_DeviceInfo.lIdMemBase+4) ); // increment PC from 0x104 to 0x1FF ( &ConfigWord )
        PIC10F_SendCmd6( 0x09, true );             // send 6-bit command "Bulk Erase Program Memory"
        PIC_HW_LongDelay_ms( 50/*milliseconds*/ ); // wait for erase (internally timed)
        // PC should still be at 0x1FF/0x3FF, so increment ONCE(!) to wrap the PC to ZERO .
        PIC10F_IncrAddress( 1 );                   // increment PC from 0x1FF or 0x3FF to zero
    } // end if "complete" or "partial" erase ?


    // Arrived here, program memory and config word, and possible USER ID + OSCCAL BACKUP
    // are erased; the PC is at zero.
    // Optionally write and verify CODE memory, then write the CONFIG word...
    for(i=0; i<PIC_DeviceInfo.lCodeMemSize; ++i)
    {
        // get next word from buffer (normal code memory location or OSCCAL) :
        PicBuf_GetBufferWord( PIC10F_iCurrTargetAddress, &dwTemp );
        w = dwTemp;  // word from buffer
        if( (PIC10F_iCurrTargetAddress==PIC_DeviceInfo.lAddressOscCal) && (! Config.iDontCareForOsccal) )
        {
            // restore the orginal OSCCAL word for this special location :
            w = PIC10F_wReadOscCalibWord;
        }
        w &= 0x0FFF;                    // 12 bit only  !
        if(   (iPicPrgAction & PIC_ACTION_WRITE)
                || ((PIC10F_iCurrTargetAddress==PIC_DeviceInfo.lAddressOscCal) && (! Config.iDontCareForOsccal))
          )
        {
            if( ! PIC10F_ProgAndVerifyOneLocation( PIC10F_iCurrTargetAddress, w, 0x0FFF,
                                                   (PIC10F_iNrOfErrors<20)/*may show error message ?*/ ) )
            {
                ++PIC10F_iNrOfErrors;
            }
        } // end if < WRITE this memory location ? >

        PIC10F_IncrAddress( 1 );   // increment PC for next code memory location
        //APPL_ShowProgress( (100*i) / PIC_DeviceInfo.lCodeMemSize );
    } // end for < all PROGRAM MEMORY locations, including the osccal word >


    // Arrived here, CODE MEMORY is finished, but not the ID locations and the config word.
    //  PC is at the first user ID location now (0x100 for PIC10F200/4, 0x200 for PIC10F202/6)
    PIC10F_iCurrTargetAddress = PIC10F_iCurrTargetAddress;  // DEBUG: must be 256 or 512 (dec.)
    if( Config.iUseCompleteChipErase )
    {
        // the User ID locations can only be reprogrammed after "erasing ALL" (?)
        for(i=0; i<=3; ++i)
        {
            PicBuf_GetBufferWord( PIC10F_iCurrTargetAddress, &dwTemp );
            w = dwTemp | 0xFF0;  // only 4 bits per location, write the upper bits as ONES (!)

