zecarlos1957/wxpic/Tags/V1.2.2/src/WinPicPr/PIC10F_PRG.cpp
            if( ! PIC10F_ProgAndVerifyOneLocation( PIC10F_iCurrTargetAddress, w, 0x0FFF, true ) )
                ++PIC10F_iNrOfErrors;
            PIC10F_IncrAddress( 1 );       // increment PC for next code memory location
        } // end for < all USER ID locations >
        // Arrived here, the PC is at the BACKUP OSCCAL value location (0x104 or 0x204).
        // Very important after "erase all":  Restore the BACKUP OSCCAL value !
        if( ! PIC10F_ProgAndVerifyOneLocation( PIC10F_iCurrTargetAddress, PIC10F_wReadOscCalibBackup, 0x0FFF, true ) )
            ++PIC10F_iNrOfErrors;
    } // end if( Config.iUseCompleteChipErase )
    else  // didn't "erase ALL", so cannot program the User ID locations
    {
        //  ... instead skip them :
        PIC10F_IncrAddress( 4 );    // increment PC from 0x100(0x200) to 0x104(0x204)
    }


    // Arrived here, the PC still points to the BACKUP OSCCAL BITS (0x104 or 0x204 or 0x404)
    // Skip the "Reserved" area as well as the "Unimplemented" area ...
    PIC10F_IncrAddress( PIC10F_iMaskAddress - (PIC_DeviceInfo.lIdMemBase+4) );

    // Finally program the configuration memory (here: ONE CONFIGURATION WORD) .
    if(iPicPrgAction & PIC_ACTION_WRITE)
    {
        PIC10F_iCurrTargetAddress = PIC10F_iCurrTargetAddress;  // DEBUG: must be 0x01FF (511) or 0x3FF (1023) here
        // Another omission in [PIC10Fps] - it seems impossible to increment the PC
        // to let it point to the CONFIGURATION WORD without quitting and re-entering
        // programming mode ?! The reason for this was unreproducable in 2005-05 .
#if(1)
        // leave and re-enter programming mode - why is this necessary ?
        // PC (theoretically) already points to config word !
        PIC10F_LeaveProgMode();
        PIC10F_EnterProgMode();
#endif
        PicBuf_GetBufferWord( PIC10F_iCurrTargetAddress, &dwTemp );  // -> CONFIG WORD !
        // Another error in [PIC10Fps], Figure 3-11: First "Load Data Command",
        // then "One-Word Programming Cycle from Fig 3-10" - which contains another "Load Data Command" ?!
        if( ! PIC10F_ProgAndVerifyOneLocation( PIC10F_iCurrTargetAddress, (uint16_t)dwTemp, 0x0FFF, true ) )
            ++PIC10F_iNrOfErrors;
    } // end if < "write" >

    PIC10F_LeaveProgMode(); // leave programming mode

    return PIC10F_iNrOfErrors==0;

} // PIC10F_ProgramAll()

// EOF < PIC10F_PRG.C >
